REPLIES = {
    "help": "🤖 Вот список команд, которые я могу обработать:\n\n<b>/help 🆘</b> - показать этот список\n<b>/register 📝</b> - пройти регистрацию в боте\n<b>/login 🔓</b> - пройти аутентификацию в боте\n<b>/logout ↪</b> - выйти из системы\n<b>/predict 🔮</b> - использовать классификатор изображений",
    "stop": "Действие отменено ⛔",
    "miss": "То что вы мне отправили, к сожалению, не является командой, которую я понимаю 😔",
    
    "all_users": "Список всех пользователей и предсказаний для них:\n\n{users}",
    "user_stat": "🪪 {role} {id}: {predictions} предсказаний 🔮\n",
    "no_args_rm": "Не передан ID пользователя для удаления ⚠️",
    "no_args_add": "Не передан ID пользователя для добавления ⚠️",
    "incorrect_id": "Некорректный ID пользователя ⛔",
    "delete_user": "Пользователь {id} успешно удалён ✅",
    "add_user": "Пользователь {id} успешно назначен администратором ✅",
    "insufficient_rights": "У вас недостаточно прав ⛔",

    "logout": "Вы успешно вышли из системы ✅",
    "not_logged": "Вы не вошли в систему ⚠️",
    "logged_in": "Вы успешно вошли в систему ✅",
    "already_logged": "Вы уже вошли в систему ⚠️",
    "login_password": "Для того чтобы войти в систему, введите пароль 🔐",
    "incorrect_psw": "Вы ввели неверный пароль ⛔\n\nПопробуйте еще раз, или отправьте мне слово \"стоп\", чтобы прекратить попытку входа ✋🏻",

    "register_start": "Для того чтобы зарегистрироваться в системе, придумайте пароль 🔐\n\nЕсли же вы передумали, просто напишите мне слово <b>стоп</b> на любом этапе ✋🏻",
    "registration_completed": "Супер 🥳\n\nПоздравляю вас, регистрация в системе завершена ✅",
    "register_confirm": "Отлично 🔒\n\nА теперь введите тот же пароль, для подтверждения ✍🏻",
    "registration_already": "Вы уже зарегистрированы в системе ⚠️",
    "passwords_are_not_same": "Введённые пароли не совпадают ⚠️\n\nПопробуйте еще раз ✍🏻",
    "not_registered": "Вы еще не зарегистрированы в системе ⚠️",

    "predict_prompt": "Отправьте мне картинку, и я скажу, <b>медведь</b> это, или <b>человек</b> 🔮\n\nЕсли же вы передумали, просто напишите слово \"стоп\" ✋🏻",
    "not_a_photo": "Это не фотография, и не команда \"стоп\" ⚠️\n\nПопробуйте еще раз ✍🏻",
    "is_predicting": "Отлично, получил ваше фото, сейчас попробую определить, что это на нём такое...🤔💭",
    "is_bear": "Я считаю что это...\n\n\t\t\t\t\t\t<b>🐻 МЕДВЕДЬ ({probability}%) 🐻‍❄️</b>",
    "is_human": "Я считаю что это...\n\n\t\t\t\t\t\t<b>🙋🏻‍♂️ ЧЕЛОВЕК ({probability}%) 🙋🏻‍♀️</b>",
    "error": "Ой, совсем не понимаю что это такое получилось...🫤"
}